IDENTIFICATION DIVISION.
PROGRAM-ID. CHAMA.
ENVIRONMENT DIVISION.
DATA DIVISION.
       working-storage section.
        77 N1   PIC 99  VALUE 1.
        77 N2   PIC 99  VALUE 1.
        77 SOMA PIC 999 VALUE 0.
PROCEDURE DIVISION.
       INICIO.
        DISPLAY "NO PROGRAMA CHAMADOR" UPON CONSOLE.
        CALL "CHAMADO" USING N1, N2, SOMA.
        DISPLAY "RESULTADO: " SOMA.
        STOP RUN.
    ERRO.
       DISPLAY "MEMÓRIA INSUFICIENTE PARA CARREGAR O PROGRAMA"
           STOP RUN.